app/controllers/contacts_controller.rb

  def index
    @contacts = Contact.all.order(:name).page(params[:page]).per(15)
---
SELECT  "contacts".* FROM "contacts" ORDER BY "contacts"."name" ASC LIMIT ? OFFSET ?  [["LIMIT", 15], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "contacts" ORDER BY "contacts"."name" ASC LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 15], ["OFFSET", 0]]